Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Your can use programmatic lookup via `jakarta.enterprise.inject.Instance` to resolve ambiguities at runtime and even iterate over all beans implementing a given type:
ja_jp: `jakarta.enterprise.inject.Instance` を通じてプログラム的なルックアップを使用して、実行時に曖昧さを解決したり、指定された型を実装しているすべてのBeanを反復処理したりすることができます:

source: Your can use programmatic lookup via `javax.enterprise.inject.Instance` to resolve ambiguities at runtime and even iterate over all beans implementing a given type:
ja_jp: `javax.enterprise.inject.Instance` を通じてプログラム的なルックアップを使用して、実行時に曖昧さを解決したり、指定された型を実装しているすべてのBeanを反復処理したりすることができます:

source: Your container image is now ready to run on Azure. Remember, the Quarkus application is mapped to run on port 80.
ja_jp: これで、コンテナーイメージをAzure上で実行する準備が整いました。Quarkusアプリケーションは、ポート80で実行するようにマッピングされていることを覚えておいてください。

source: Your custom extension would need to extend `quarkus-oidc` and add the dependencies required to support your provider to the extension's `deployment` module only.
ja_jp: カスタムエクステンションは、 `quarkus-oidc` を拡張し、プロバイダーをサポートするために必要な依存関係をエクステンションの `deployment` モジュールにのみ追加する必要があります。

source: Your database migrations with Flyway and Liquibase are now run as init containers in manifests.
ja_jp: FlywayとLiquibaseを使ったデータベースマイグレーションは、マニフェストのinit containersとして実行されるようになりました。

source: Your decision to choose whether to use opaque or JWT token format will be driven by architectural considerations. Opaque tokens tend to be much shorter than JWT tokens but need most of the token-associated state to be maintained in the provider database. Opaque tokens are effectively database pointers. JWT tokens are significantly longer than the opaque tokens but the providers are effectively delegating storing most of the token-associated state to the client by storing it as the token claims and either signing or encrypting them.
ja_jp: 不透明トークンかJWTトークンのどちらを使うかは、アーキテクチャ上の考慮事項によって決定されます。不透明トークンは、JWTトークンよりもはるかに短い傾向がありますが、トークンに関連する状態の大部分をプロバイダ・データベースに保持することが必要です。不透明トークンは、事実上データベース・ポインタです。JWTトークンは不透明トークンよりもかなり長いですが、プロバイダはトークン関連状態のほとんどをトークンクレームとして保存し、署名または暗号化することにより、クライアントに保存を事実上委任しています。

source: Your deployment time module should depend on `io.quarkus:quarkus-core-deployment`, your runtime artifact, and the deployment artifacts of any other Quarkus extensions your own extension depends on. This is essential, otherwise any transitively pulled in extensions will not provide their full functionality.
ja_jp: デプロイメントタイムモジュールは、 `io.quarkus:quarkus-core-deployment` ランタイムアーティファクト、および自身のエクステンションが依存する他の Quarkus エクステンションのデプロイメントアーティファクトに依存する必要があります。 これは重要です。依存しない場合、間接的に取り込まれたエクステンションがその機能を十分に提供できなくなります。

source: Your endpoints can return `Uni` or `Multi` instances:
ja_jp: そして、エンドポイントは `Uni` や `Multi` のインスタンスを返すことができます:

source: Your endpoints will be available on http://localhost:8080.
ja_jp: エンドポイントは http://localhost:8080 で利用できます。

source: Your entity implements `PanacheEntity.Reactive`
ja_jp: エンティティーが `PanacheEntity.Reactive` を実装します。

source: Your exception mapper may declare any of the following parameter types:
ja_jp: 例外マッパーは、次のパラメーター型のいずれかを宣言できます。

source: Your extension can add additional, non-application endpoints to be served alongside endpoints for Health, Metrics, OpenAPI, Swagger UI, etc.
ja_jp: エクステンションは、Health、Metrics、OpenAPI、Swagger UIなどのエンドポイントと一緒に提供される、アプリケーション以外のエンドポイントを追加することができます。

source: Your extension codestart must/should be independent of buildtool and dockerfiles.
ja_jp: あなたのエクステンションCodestartは、buildtoolやdockerfilesから独立していなければなりません/しなければなりません。

source: Your extension declares 2 sub-modules `deployment` and `runtime`.
ja_jp: エクステンションは、2 つのサブモジュール `deployment` と `runtime` を宣言しています。

source: Your extension is a multi-module project. So let's start by checking out the parent POM at `./greeting-extension/pom.xml`.
ja_jp: お使いのエクステンションはマルチモジュールプロジェクトです。まずは、 `./quarkus-greeting/pom.xml` の親 POM から見ていきましょう。

source: Your extension is published in Maven Central
ja_jp: エクステンションがMaven Centralで公開されていること

source: Your extension needs to have the following dependency in it's deployment module:
ja_jp: あなたのエクステンションのデプロイメントモジュールには、以下の依存関係が必要です。

source: Your extension project should be setup as a multi-module project with two submodules:
ja_jp: エクステンションプロジェクトは、2つのサブモジュールを持つマルチモジュールプロジェクトとして設定する必要があります。

source: Your extension repository is configured to use the <<ecosystem-ci, Ecosystem CI>>.
ja_jp: エクステンションリポジトリーは、<<ecosystem-ci, Ecosystem CI>> を使用するように設定されています。

source: Your extension repository is configured to use the <<ecosystem-ci,Ecosystem CI>>.
ja_jp: エクステンションリポジトリーは、<<ecosystem-ci,Ecosystem CI>> を使用するように設定されています。

source: Your extension repository is configured to use the xref:ecosystem-ci[Ecosystem CI].
ja_jp: エクステンションリポジトリは、 xref:ecosystem-ci[Ecosystem CI] を使用するように構成されています。

source: Your filters may declare any of the following parameter types:
ja_jp: フィルターは、次のパラメーター型のいずれかを宣言できます。

source: Your final archive will look like this:
ja_jp: 最終的なアーカイブは以下のようになります。

source: Your goal is to assign each lesson to a time slot and a room. You will create these classes:
ja_jp: 目標は、各レッスンをタイムスロットと教室に割り当てることです。次のクラスを作成します。

source: Your help is more than welcome! Don’t hesitate to join the crowd.
ja_jp: あなたの参加は大歓迎です！躊躇わずに参加して下さい。

source: Your implemented provider must be a CDI bean. Here's an example:
ja_jp: 実装するプロバイダーは CDI Bean である必要があります。次に例を示します。

source: Your macOS has the wrong `*.h` files compared to the OS and no gcc compilation will work. This can happen when you migrate from versions of the OS. See https://stackoverflow.com/questions/48029309/cannot-compile-any-c-programs-error-unknown-type-name-uint8-t
ja_jp: お使いの macOS には、その OS とは異なる `*.h` ファイルがあるため、gcc コンパイルが動作しません。この問題は、その OS の別のバージョンから移行したときに起こる可能性があります。 https://stackoverflow.com/questions/48029309/cannot-compile-any-c-programs-error-unknown-type-name-uint8-t を参照してください。

source: Your method uses a blocking signature.
ja_jp: メソッドがブロッキング・シグネチャを使っていること。

source: Your other option is to use `OidcClient` methods for acquiring or refreshing tokens that accept additional grant parameters, for example, `oidcClient.getTokens(Map.of("client_assertion", "ey..."))`.
ja_jp: もう 1 つの選択肢は、追加のグラントパラメーターを受け入れるトークンを取得または更新するために `OidcClient` メソッドを使用することです。たとえば、 `oidcClient.getTokens(Map.of("client_assertion", "ey..."))` を使用します。

source: Your other option is to use `OidcClient` methods for acquiring or refreshing tokens which accept additional grant parameters, for example, `oidcClient.getTokens(Map.of("client_assertion", "ey..."))`.
ja_jp: 他のオプションとして、追加のグラントパラメーターを受け入れるトークンを取得または更新するには、 `OidcClient` メソッドを使用できます (例: `oidcClient.getTokens(Map.of("client_assertion", "ey..."))`)。

source: Your output should be as follows:
ja_jp: 出力は以下のようになるはずです:

source: Your page can be any Page similar to Cards.
ja_jp: ページはカードに似た任意のページにできます。

source: Your preview should contain a new section, "3. Dev Mode: Hello, World!" That section should include three methods of launching Quarkus dev mode (cli, maven, gradle). It should have codeblocks containing curl console commands and output, and instructions for how to exit dev mode.
ja_jp: プレビューには、新しいセクション "3. Dev Mode: Hello, World!" が含まれているはずです。このセクションには、Quarkus の開発モードを起動する 3 つのメソッド (cli、maven、gradle) が含まれている必要があります。また、curl コンソールコマンドと出力を含むコードブロック、および開発モードを終了する方法が含まれている必要があります。

source: Your preview should contain a new section, `2. Hello, World! as an Acme REST service` that includes the contents of `src/main/java/org/acme/MyAcmeApplication.java` with the `goodbye` method omitted.
ja_jp: プレビューには、新しいセクション `2. Hello, World! as an Acme REST service` が含まれている必要があります。これには、 `goodbye` メソッドが省略された `src/main/java/org/acme/MyAcmeApplication.java` のコンテンツが含まれています。

source: Your preview should contain a new section, `4. Testing: Hello, World!` that includes the contents of `src/main/java/org/acme/MyAcmeApplicationTest.java` with the `testGoodbyeEndpoint` method omitted.
ja_jp: プレビューには、新しいセクション `4. Testing: Hello, World!` が含まれている必要があります。これには、 `testGoodbyeEndpoint` メソッドが省略された `src/main/java/org/acme/MyAcmeApplicationTest.java` のコンテンツが含まれています。

source: Your preview should now contain an unnumbered `Summary` section.
ja_jp: プレビューには、番号のない `Summary` セクションが含まれているはずです。

source: Your preview should now contain two new sections, `5. Goodbye, Sweet Planet! Server sent events with Acme` and `6. Testing: Goodbye, Sweet Planet!`.
ja_jp: プレビューには、2 つの新しいセクション `5. Goodbye, Sweet Planet! Server sent events with Acme` および `6. Testing: Goodbye, Sweet Planet!` が含まれているはずです。

source: Your project is hosted in a Git repository.
ja_jp: プロジェクトがGitリポジトリにホストされていること

source: Your project might use an extension that is incompatible with the latest {project-name} version.
ja_jp: {project-name} の最新バージョンと互換性のないエクステンションを使用している可能性があります。

source: Your repository extends `PanacheRepository.Reactive`
ja_jp: リポジトリーが `PanacheRepository.Reactive` を拡張します。

source: Your results may vary for several reasons:
ja_jp: 結果はいくつかの理由で異なる場合があります。

source: Your runtime artifact should depend on `io.quarkus:quarkus-core`, and possibly the runtime artifacts of other Quarkus modules if you want to use functionality provided by them.
ja_jp: ランタイムアーティファクトは `io.quarkus:quarkus-core` に依存する必要があります。また、他の Quarkus モジュールが 提供する機能を使用したい場合は、それらのランタイムアーティファクトにも依存する必要があります。

source: Your runtime artifact should depend on `io.quarkus:quarkus-core`, and possibly the runtime artifacts of other Quarkus modules if you want to use functionality provided by them. Your deployment time module should depend on `io.quarkus:quarkus-core-deployment`, your runtime artifact, and possibly the deployment artifacts of other Quarkus modules if you want to use functionality provided by them.
ja_jp: 実行時アーティファクトは、 `io.quarkus:quarkus-core` や 、おそらく他のQuarkusモジュールの実行時アーティファクトに依存する必要があります。デプロイメント時モジュールは、 `io.quarkus:quarkus-core-deployment` や、実行時アーティファクト、およびおそらく他のQuarkusモジュールが提供する機能を使用したい場合は、そのデプロイメントアーティファクトに依存する必要があります。

source: Your second Quarkus application
ja_jp: 2つ目のQuarkusアプリケーション

source: Your service will assign `Lesson` instances to `Timeslot` and `Room` instances automatically by using AI to adhere to hard and soft scheduling _constraints_, such as the following examples:
ja_jp: サービスは、ハードおよびソフトスケジューリング _制約_ に従い、AI を使用して自動的に `Lesson` インスタンスを `Timeslot` および `Room` インスタンスに割り当てます。

source: Your session will be of type `StatelessSession` instead of `Session`.
ja_jp: セッションの型は `Session` ではなく `StatelessSession` になります。

source: Your tag definition has to be the filename without the `.js`
ja_jp: タグ定義は、`.js` を含まないファイル名である必要があります。

source: Your test class needs to be annotated like with `@QuarkusTestResource(MockAuthorizationServerTestResource.class)` to use this `QuarkusTestResourceLifecycleManager`.
ja_jp: この `QuarkusTestResourceLifecycleManager` を使用するためには、テストクラスに `@QuarkusTestResource(MockAuthorizationServerTestResource.class)` のようなアノテーションを付ける必要があります。

source: Your titles and headings must also follow the specific guidance for the Quarkus content types, as outlined in the following table:
ja_jp: タイトルと見出しは、次の表に示すように、Quarkus のコンテンツタイプに固有のガイダンスにも従っている必要があります。

source: Zero Config Setup (Dev Services)
ja_jp: ゼロコンフィグセットアップ（DevServices）

source: Zero Config Setup with DevServices
ja_jp: DevServicesによるゼロコンフィグ設定

source: Zero config, live reload in the blink of an eye
ja_jp: ゼロコンフィグ、瞬く間のライブリロード

source: Zero indexed page number. Invalid value is interpreted as 0.
ja_jp: 0始まりのインデックスのページ番号。無効な値は0と解釈されます。

source: Zero-config setup in development mode
ja_jp: 開発モードでのゼロコンフィグセットアップ

source: Zipkin compatibility mode
ja_jp: Zipkin互換モード

source: [[build-analytics-quarkus-analytics-disabled]]`link:#build-analytics-quarkus-analytics-disabled[quarkus.analytics.disabled]` Values can be `true` or `false`. Setting this property to `true` will disable the collection of analytics data on that specific project regardless of any other configuration.
ja_jp: [[build-analytics-quarkus-analytics-disabled]]`link:#build-analytics-quarkus-analytics-disabled[quarkus.analytics.disabled]` 値は `true` もしくは `false` です。 このプロパティを `true` に設定すると、他の設定に関係なく、そのプロジェクトでの分析データの収集が無効になります。

source: [[build-analytics-quarkus-analytics-disabled]]`link:#build-analytics-quarkus-analytics-disabled[quarkus.analytics.disabled]` Values can be `true` or `false`. Setting this property to `true` will disable the collection of analytics data on that specific project, regardless of any other configuration.
ja_jp: [[build-analytics-quarkus-analytics-disabled]]`link:#build-analytics-quarkus-analytics-disabled[quarkus.analytics.disabled]` 値は `true` または `false` になります。 このプロパティーを `true` に設定すると、他の設定に関係なく、その特定のプロジェクトでのアナリティクスデータの収集が無効になります。

source: [[build-analytics-quarkus-analytics-timeout]]`link:#build-analytics-quarkus-analytics-timeout[quarkus.analytics.timeout]` Value in milliseconds for the timeout of the HTTP request to submit the analytics service.
ja_jp: [[build-analytics-quarkus-analytics-timeout]]`link:#build-analytics-quarkus-analytics-timeout[quarkus.analytics.timeout]` 分析サービスに送信するHTTPリクエストのタイムアウトの値（ミリ秒）。

source: [[build-analytics-quarkus-analytics-uri-base]]`link:#build-analytics.quarkus-analytics-uri-base[quarkus.analytics.uri.base]` Base URL of the analytics service. This is were all the data is sent to.
ja_jp: [[build-analytics-quarkus-analytics-uri-base]]`link:#build-analytics.quarkus-analytics-uri-base[quarkus.analytics.uri.base]` 分析サービスのベースURL。これが全てのデータの送信先です。

source: [[configuration-reference-aws]] AWS request signing
ja_jp: [[configuration-reference-aws]] AWSのリクエストの署名

source: [[declaring-uri-parameters]] Declaring URI parameters
ja_jp: [[declaring-uri-parameters]] URI パラメーターの宣言

source: [[development-mode]] Dev mode
ja_jp: [[development-mode]] 開発モード

source: [[how-to-register-as-nexus-repository]] How to register as a Nexus Repository proxy
ja_jp: [[how-to-register-as-nexus-repository]] Nexusリポジトリプロキシとして登録する方法

source: [[inject-the-default-and-named-clients]] Inject the default and named clients
ja_jp: [[inject-the-default-and-named-clients]] デフォルトおよび名前付きクライアントを注入する

source: [[looks-good-what-is-the-bean-scope]] Looks good. What is the bean scope?
ja_jp: [[looks-good-what-is-the-bean-scope]] 良いですね。Beanスコープとは何ですか?

source: [[path-parameter]]Path parameter
ja_jp: [[path-parameter]]パスパラメーター

source: [[quarkus-blaze-persistence_configuration]]link:#quarkus-blaze-persistence_configuration[Configuration property]
ja_jp: [[quarkus-blaze-persistence_configuration]]link:#quarkus-blaze-persistence_configuration[設定プロパティー]

source: [[quarkus-kogito-dev-services-build-time-config_configuration]]link:#quarkus-kogito-dev-services-build-time-config_configuration[Configuration property]
ja_jp: [[quarkus-kogito-dev-services-build-time-config_configuration]]link:#quarkus-kogito-dev-services-build-time-config_configuration[設定プロパティ]

source: [[resteasy_integration]] REST Integration
ja_jp: [[resteasy_integration]] REST インテグレーション

source: [[supported_features]][[limitations]] Supported Features and Limitations
ja_jp: [[supported_features]][[limitations]] サポートされている機能と制限

source: [[twitter]] X (formerly Twitter)
ja_jp: [[twitter]] X (旧 Twitter)

source: [[what-scopes-can-i-actually-use-in-my-quarkus-application]] What scopes can I actually use in my Quarkus application?
ja_jp: [[what-scopes-can-i-actually-use-in-my-quarkus-application]] 実際にQuarkusアプリケーションで使用できるスコープは何ですか?

source: _Almost no magic_
ja_jp: _殆どマジックなし_

source: _Anything else_
ja_jp: _その他_

source: _Bootstrap_ configuration steps are executed during runtime-init *before* any of other runtime steps. This means that code executed as part of this step cannot access anything that gets initialized in runtime init steps (runtime synthetic CDI beans being one such example).
ja_jp: _Bootstrap_ 設定ステップは、runtime-init 中に、他のランタイムステップの *前* に実行されます。これは、このステップの一部として実行されたコードが、ランタイムの初期化ステップで初期化されるものにアクセスできないことを意味します (実行時の合成 CDI Bean はその一例です)。

source: _Channels_ are identified by a unique name and declared using a set of annotations.
ja_jp: _チャネル_ は一意の名前で識別され、一連のアノテーションを使用して宣言されます。

source: _For more information about how to install the Quarkus CLI and use it, please refer to xref:cli-tooling.adoc[the Quarkus CLI guide]._
ja_jp: _Quarkus CLIのインストール方法や使用方法については、 xref:cli-tooling.adoc[Quarkus CLIガイド] を参照してください。_

source: _Frictionless Development Experience:_ The live coding feature provides instant feedback during development, dramatically accelerating the inner development loop and enabling faster iteration on catalog capabilities and security enhancements.
ja_jp: _摩擦のない開発体験:_ ライブコーディング機能は、開発中に即座にフィードバックを提供し、内部開発ループを劇的に加速させ、カタログ機能やセキュリティ強化のより迅速なイテレーションを可能にします。

source: _If debugging is the process of removing bugs, then programming must be the process of putting them in._ Edsger W. Dijkstra
ja_jp: デバッグ作業がバグを取り除く作業であるならば、プログラミングとは、バグを入れ込む作業ということになる。エドガー・W・ダイクストラ

source: _Mutiny_ verticle - Java classes extending `io.smallrye.mutiny.vertx.core.AbstractVerticle`
ja_jp: _Mutiny_ verticle - `io.smallrye.mutiny.vertx.core.AbstractVerticle` を拡張するJavaクラス

source: _Named_ clients are configured using the `quarkus.infinispan-client.<name>.*` properties:
ja_jp: _名前付き_ クライアントは、 `quarkus.infinispan-client.<name>.*` プロパティを使用して設定します：

source: _Named_ clients are configured using the `quarkus.redis.<name>.*` properties:
ja_jp: _名前付き_ クライアントは `quarkus.redis.<name>.*` プロパティーを使用して設定されます。

source: _No value_
ja_jp: _値なし_

source: _Not created if omitted_
ja_jp: _省略された場合は作成されない_

source: _Note: To remain compatible with earlier versions of Quarkus (before 0.16) the default password is set to "password". It is therefore not a mandatory parameter!_
ja_jp: _注意：Quarkusの以前のバージョン（0.16以前）との互換性を保つため、デフォルトのパスワードは "password "に設定されています。そのため、必須パラメータではありません！_

source: _Note: in order to remain compatible with earlier versions of Quarkus (before 0.16) the default password is set to "password". It is therefore not a mandatory parameter!_
ja_jp: 注意: Quarkus の以前のバージョン (0.16以前) との互換性を維持するために、デフォルトのパスワードは "password" に設定されています。したがって、これは必須のパラメーターではありません。

source: _Please test this carefully on compilation to native images and fallback to Java-compatible Jackson bindings if you experience problems._
ja_jp: _ネイティブイメージへのコンパイル時には慎重にテストし、問題が発生した場合はJava互換のJacksonバインディングにフォールバックしてください。_

source: _Programming Model Flexibility:_ Quarkus supports three execution approaches: plain imperative code, reactive programming using the Mutiny API, and virtual threads (JDK 21+), allowing developers to choose the right model for each component. This versatility means Polaris developers can use familiar imperative patterns for simple management endpoints (such as health checks) while fully leveraging the reactive/non-blocking approach (with Mutiny or virtual threads) for high-concurrency, I/O-intensive catalog operations (such as metadata lookups and commits).
ja_jp: _プログラミングモデルの柔軟性:_ Quarkus は、プレーンな命令型コード、Mutiny API を使用したリアクティブプログラミング、仮想スレッド (JDK 21+) の 3 つの実行アプローチをサポートしており、開発者は各コンポーネントに適切なモデルを選択できます。この汎用性により、Polaris の開発者は、シンプルな管理エンドポイント (ヘルスチェックなど) には慣れ親しんだ命令型パターンを使用しながら、高並行で I/O 集中型のカタログ操作 (メタデータルックアップやコミットなど) にはリアクティブ/非ブロッキングアプローチ (Mutiny または仮想スレッドを使用) を最大限に活用できます。

source: _Protocol Diversity:_ Native support for REST, gRPC, GraphQL, and message brokers (Kafka, RabbitMQ, Pulsar, Apache ActiveMQ) gives Polaris flexibility in how it exposes catalog APIs and integrates with the broader data ecosystem.
ja_jp: _プロトコルの多様性:_ REST、gRPC、GraphQL、およびメッセージブローカー (Kafka、RabbitMQ、Pulsar、Apache ActiveMQ) のネイティブサポートにより、Polaris はカタログ API の公開方法や、より広範なデータエコシステムとの統合において柔軟性を持ちます。

source: _Quarkus Chicory brings Chicory to Quarkus application developers, integrating its features into the Quarkus ecosystem and applications build-time and runtime peculiarities, for a natural developer experience. It just... works!_
ja_jp: _Quarkus Chicory は、Chicory を Quarkus アプリケーション開発者にもたらし、その機能を Quarkus エコシステムやアプリケーションのビルド時および実行時の特性に統合して、自然な開発体験を提供します。まさに、ただ動くのです！_

source: _Reactive_ is a set of principles and guidelines to build responsive distributed systems and applications. The https://www.reactivemanifesto.org/[Reactive Manifesto] characterizes _Reactive Systems_ as distributed systems having four characteristics:
ja_jp: _リアクティブ_ とは、応答性の高い分散システムやアプリケーションを構築するための原則とガイドラインのセットです。 link:https://www.reactivemanifesto.org/[リアクティブマニフェスト]では、 _リアクティブシステム_ を4つの特徴を持つ分散システムとしています。

source: _Reactive_ is a set of principles to build robust, efficient, and concurrent applications and systems. These principles let you handle more load than traditional approaches while using the resources (CPU and memory) more efficiently while also reacting to failures gracefully.
ja_jp: _リアクティブ_ とは、堅牢で効率的、かつコンカレントなアプリケーションやシステムを構築するための一連の原則です。これらの原則により、従来のアプローチよりも多くの負荷を処理しながら、リソース（CPUやメモリ）をより効率的に使用し、また障害にも適切に対応することができます。

source: _Reason 1_: Class Is Not discovered
ja_jp: _理由1_ :クラスが発見されない

source: _Reason 2_: Class Is Discovered but Has No Bean Defining Annotation
ja_jp: _理由2_ : クラスは発見されたが、Beanを定義するアノテーションがない

source: _Reason 3_: Class Was Discovered and Has a Bean Defining Annotation but Was Removed
ja_jp: _理由3_: クラスが検出され、Bean 定義のアノテーションがあるが削除された

source: _Regular_ Quarkus
ja_jp: _通常の_ Quarkus

source: _Solution 1_: Use the `AutoAddScopeBuildItem`. This build item can be used to add a scope to a class that meets certain conditions.
ja_jp: _解決策1_ : `AutoAddScopeBuildItem` の使用。このビルドアイテムを使用すると、特定の条件を満たすクラスにスコープを追加することができます。

source: _Solution 1_: `BeanDiscoveryFinishedBuildItem`
ja_jp: _解決策1._ `BeanDiscoveryFinishedBuildItem`

source: _Solution 2_: If you need to process classes annotated with a specific annotation then it's possible to extend the set of bean defining annotations via the `BeanDefiningAnnotationBuildItem`.
ja_jp: _解決策2_: 特定のアノテーションが付けられたクラスを処理する必要がある場合は、 `BeanDefiningAnnotationBuildItem` を介して Bean 定義アノテーションのセットを拡張することができます。

source: _Solution 2_: If you need to process classes annotated with a specific annotation, then it's possible to extend the set of bean defining annotations via the `BeanDefiningAnnotationBuildItem`.
ja_jp: _解決策 2_: 特定のアノテーションが付けられたクラスを処理する必要がある場合は、 `BeanDefiningAnnotationBuildItem` を介して Bean 定義アノテーションのセットを拡張できます。

source: _Solution 2_: `SynthesisFinishedBuildItem`
ja_jp: _解決策2_ : `SynthesisFinishedBuildItem`

source: _Solution_: If an extension needs to validate the deployment it should use the `ValidationPhaseBuildItem`.
ja_jp: _解決策_: エクステンションがデプロイメントを検証する必要がある場合、 `ValidationPhaseBuildItem` を使用します。

source: _Solution_: If an extension needs to validate the deployment, it should use the `ValidationPhaseBuildItem`.
ja_jp: _解決策_: エクステンションがデプロイメントを検証する必要がある場合、 `ValidationPhaseBuildItem` を使用します。

source: _Solution_: If you need to register a custom context, use the `ContextRegistrationPhaseBuildItem`.
ja_jp: _解決策_: カスタムコンテキストを登録する必要がある場合は、 `ContextRegistrationPhaseBuildItem` を使用します。

source: _Solution_: If you need to register a synthetic bean then use the `SyntheticBeanBuildItem`.
ja_jp: _解決策_: 合成 Bean を登録する必要がある場合は、 `SyntheticBeanBuildItem` を使用します。

source: _Solution_: If you need to register a synthetic observer, use the `ObserverRegistrationPhaseBuildItem`.
ja_jp: _解決策_: 合成オブザーバーを登録する必要がある場合は、 `ObserverRegistrationPhaseBuildItem` を使用します。

source: _Solution_: Use the `AdditionalBeanBuildItem` as described in <<additional_bean_build_item>>.
ja_jp: _解決策_: <<additional_bean_build_item>> で説明されているとおりに `AdditionalBeanBuildItem` を使用します。

source: _Solution_: Use the `AdditionalBeanBuildItem`. This build item can be used to specify one or more additional classes to be analyzed during the discovery. Additional bean classes are transparently added to the application index processed by the container.
ja_jp: _解決策_ 。 `AdditionalBeanBuildItem` .このビルド項目は、ディスカバリー中に解析する1つ以上の追加クラスを指定するために使用することができます。追加のBean・クラスは、コンテナーによって処理されるアプリケーション・インデックスに透過的に追加されます。
